In [1]:
import pandas as pd
import numpy as np

In [18]:
import warnings
warnings.filterwarnings('ignore')

In [19]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [20]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [21]:
df.shape

(5, 4)

Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [22]:
for i in range(1,df.shape[0]):
  df['FlightNumber'][i]=df['FlightNumber'][i-1]+10

In [23]:
df['FlightNumber']=df['FlightNumber'].astype(int)
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [24]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [25]:
df[['From', 'To']] = df['From_To'].str.split('_', expand = True)

In [26]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [27]:
df['From']=df['From'].str.capitalize()
df['To']=df['To'].str.capitalize()
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, eachsecond value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [28]:
df['RecentDelays'][0][0]

23

In [29]:
for i in range(df.shape[0]):
  a=len(df['RecentDelays'][i])
  if a==0:
    df['RecentDelays'][i][0:3]=[np.nan,np.nan,np.nan]
  elif a==1:
    df['RecentDelays'][i][1:3]=[np.nan,np.nan]
  elif a==2:
    df['RecentDelays'][i][2:3]=[np.nan]

In [30]:
df['RecentDelays']

0      [23, 47, nan]
1    [nan, nan, nan]
2       [24, 43, 87]
3     [13, nan, nan]
4      [67, 32, nan]
Name: RecentDelays, dtype: object

In [31]:
x1=[]
x2=[]
x3=[]

for i in range(df.shape[0]):
  x1.append(df['RecentDelays'][i][0])
  x2.append(df['RecentDelays'][i][1])
  x3.append(df['RecentDelays'][i][2])

df['delay_1']=x1
df['delay_2']=x2
df['delay_3']=x3

In [32]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,LoNDon_paris,10045,"[23, 47, nan]",KLM(!),London,Paris,23.0,47.0,NaN
1,MAdrid_miLAN,10055,"[nan, nan, nan]",<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,Budapest_PaRis,10075,"[13, nan, nan]",12. Air France,Budapest,Paris,13.0,NaN,NaN
4,Brussels_londOn,10085,"[67, 32, nan]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [33]:
df.drop('RecentDelays',axis=1,inplace=True)
df

,From_To,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,LoNDon_paris,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,MAdrid_miLAN,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,londON_StockhOlm,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,Budapest_PaRis,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,Brussels_londOn,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN